src/Enums/ТипыОповещенийССервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыОповещенийССервера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КомандаОткрытияВРежимеПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформационныеБазыОбновитьФормаСписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВывестиСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВывестиТекстовуюИнформацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитьКоманду</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ОбработкаОповещенийССервераКлиент/Ext/Module.bsl
//
//
Функция ОбработкаОповещенийССервера() Экспорт
	
	МассивСообщений = ОбработкаОповещенийССервераСервер.ПолучитьСообщенияССервера();
	
	Для Каждого ТекущееСообщениеМассивСообщений Из МассивСообщений Цикл 
		
		Если ТекущееСообщениеМассивСообщений.ТипОповещенияССервера = ПредопределенноеЗначение("Перечисление.ТипыОповещенийССервера.КомандаОткрытияВРежимеПредприятия") Тогда
			ЗадачиНаКлиенте.КомандаЗапуститьПредприятие(Неопределено, ТекущееСообщениеМассивСообщений.ПараметрыОбработки);
		ИначеЕсли ТекущееСообщениеМассивСообщений.ТипОповещенияССервера = ПредопределенноеЗначение("Перечисление.ТипыОповещенийССервера.ИнформационныеБазыОбновитьФормаСписка") Тогда
			Оповестить("ИнформационныеБазы.Обновить.ФормаСписка");
		ИначеЕсли ТекущееСообщениеМассивСообщений.ТипОповещенияССервера = ПредопределенноеЗначение("Перечисление.ТипыОповещенийССервера.ВывестиСообщение") Тогда
			Сообщить(ТекущееСообщениеМассивСообщений.ПараметрыОбработки);
		ИначеЕсли ТекущееСообщениеМассивСообщений.ТипОповещенияССервера = ПредопределенноеЗначение("Перечисление.ТипыОповещенийССервера.ВывестиТекстовуюИнформацию") Тогда			
			ЗадачиНаКлиенте.ПоказатьТекстовуюИнформацию("Информация", ТекущееСообщениеМассивСообщений.ПараметрыОбработки);
		ИначеЕсли ТекущееСообщениеМассивСообщений.ТипОповещенияССервера = ПредопределенноеЗначение("Перечисление.ТипыОповещенийССервера.ВыполнитьКоманду") Тогда			
			Выполнить(ТекущееСообщениеМассивСообщений.ПараметрыОбработки);
		КонецЕсли;		
		
	КонецЦикла;
	
КонецФункции
